/*****************************************************************************/ 
/*****************************************************************************/ 
//文件名必须保存为 dht111.h
#ifndef __DHT11_H__
#define __HDT11_H__

//设定标志(static unsigned char status)的宏值
#define OK 1
#define ERROR 0 

extern void Delay_1ms(unsigned int ms); 
//函数的返回值表示读取数据是否成功 OK 表示成功 ERROR 表示失败
extern unsigned char DHT11_ReadTempAndHumi(void); 
/*可在其他的文件引用温湿度值,实际是温度的整数的 10 倍
如 dht11 读回的温度是 26,则 temp_value = 260,  湿度同理*/ 
extern int temp_value, humi_value; 

#endif 

/*****************************************************************************/ 
/*****************************************************************************/ 